Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4CP16B_0.xml
        <register caption="PWM Enable Register" name="PWM_ENA" offset="0x04" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Disable Register" name="PWM_DIS" offset="0x08" rw="W" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Status Register" name="PWM_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Interrupt Enable Register" name="PWM_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Channel ID." mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID." mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID." mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID." mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Interrupt Disable Register" name="PWM_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Channel ID." mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID." mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID." mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID." mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Interrupt Mask Register" name="PWM_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel ID." mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID." mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID." mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID." mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Interrupt Status Register" name="PWM_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Channel ID" mask="0x00000001" name="CHID0"/>
          <bitfield caption="Channel ID" mask="0x00000002" name="CHID1"/>
          <bitfield caption="Channel ID" mask="0x00000004" name="CHID2"/>
          <bitfield caption="Channel ID" mask="0x00000008" name="CHID3"/>
        </register>
        <register caption="PWM Channel Mode Register (ch_num = 0)" name="PWM_CMR0" offset="0x200" rw="RW" size="4">
          <bitfield caption="Channel Pre-scaler" mask="0x0000000F" name="CPRE" values="PWM_CMR0__CPRE"/>
          <bitfield caption="Channel Alignment" mask="0x00000100" name="CALG"/>
          <bitfield caption="Channel Polarity" mask="0x00000200" name="CPOL"/>
          <bitfield caption="Channel Update Period" mask="0x00000400" name="CPD"/>
        </register>
        <register caption="PWM Channel Duty Cycle Register (ch_num = 0)" name="PWM_CDTY0" offset="0x204" rw="RW" size="4">
          <bitfield caption="Channel Duty Cycle" mask="0xFFFFFFFF" name="CDTY"/>
        </register>
        <register caption="PWM Channel Period Register (ch_num = 0)" name="PWM_CPRD0" offset="0x208" rw="RW" size="4">
          <bitfield caption="Channel Period" mask="0xFFFFFFFF" name="CPRD"/>
        </register>
        <register caption="PWM Channel Counter Register (ch_num = 0)" name="PWM_CCNT0" offset="0x20C" rw="R" size="4">
          <bitfield caption="Channel Counter Register" mask="0xFFFFFFFF" name="CNT"/>
        </register>
        <register caption="PWM Channel Update Register (ch_num = 0)" name="PWM_CUPD0" offset="0x210" rw="W" size="4">
          <bitfield mask="0xFFFFFFFF" name="CUPD"/>
        </register>
        <register caption="PWM Channel Mode Register (ch_num = 1)" name="PWM_CMR1" offset="0x220" rw="RW" size="4">
          <bitfield caption="Channel Pre-scaler" mask="0x0000000F" name="CPRE" values="PWM_CMR1__CPRE"/>
          <bitfield caption="Channel Alignment" mask="0x00000100" name="CALG"/>
          <bitfield caption="Channel Polarity" mask="0x00000200" name="CPOL"/>
          <bitfield caption="Channel Update Period" mask="0x00000400" name="CPD"/>
        </register>
        <register caption="PWM Channel Duty Cycle Register (ch_num = 1)" name="PWM_CDTY1" offset="0x224" rw="RW" size="4">
          <bitfield caption="Channel Duty Cycle" mask="0xFFFFFFFF" name="CDTY"/>
        </register>
        <register caption="PWM Channel Period Register (ch_num = 1)" name="PWM_CPRD1" offset="0x228" rw="RW" size="4">
          <bitfield caption="Channel Period" mask="0xFFFFFFFF" name="CPRD"/>
        </register>
        <register caption="PWM Channel Counter Register (ch_num = 1)" name="PWM_CCNT1" offset="0x22C" rw="R" size="4">
          <bitfield caption="Channel Counter Register" mask="0xFFFFFFFF" name="CNT"/>
        </register>
        <register caption="PWM Channel Update Register (ch_num = 1)" name="PWM_CUPD1" offset="0x230" rw="W" size="4">
          <bitfield mask="0xFFFFFFFF" name="CUPD"/>
        </register>
        <register caption="PWM Channel Mode Register (ch_num = 2)" name="PWM_CMR2" offset="0x240" rw="RW" size="4">
          <bitfield caption="Channel Pre-scaler" mask="0x0000000F" name="CPRE" values="PWM_CMR2__CPRE"/>
          <bitfield caption="Channel Alignment" mask="0x00000100" name="CALG"/>
          <bitfield caption="Channel Polarity" mask="0x00000200" name="CPOL"/>
          <bitfield caption="Channel Update Period" mask="0x00000400" name="CPD"/>
        </register>
        <register caption="PWM Channel Duty Cycle Register (ch_num = 2)" name="PWM_CDTY2" offset="0x244" rw="RW" size="4">
          <bitfield caption="Channel Duty Cycle" mask="0xFFFFFFFF" name="CDTY"/>
        </register>
        <register caption="PWM Channel Period Register (ch_num = 2)" name="PWM_CPRD2" offset="0x248" rw="RW" size="4">
          <bitfield caption="Channel Period" mask="0xFFFFFFFF" name="CPRD"/>
        </register>
        <register caption="PWM Channel Counter Register (ch_num = 2)" name="PWM_CCNT2" offset="0x24C" rw="R" size="4">
          <bitfield caption="Channel Counter Register" mask="0xFFFFFFFF" name="CNT"/>
        </register>
        <register caption="PWM Channel Update Register (ch_num = 2)" name="PWM_CUPD2" offset="0x250" rw="W" size="4">
          <bitfield mask="0xFFFFFFFF" name="CUPD"/>
        </register>
        <register caption="PWM Channel Mode Register (ch_num = 3)" name="PWM_CMR3" offset="0x260" rw="RW" size="4">
          <bitfield caption="Channel Pre-scaler" mask="0x0000000F" name="CPRE" values="PWM_CMR3__CPRE"/>
          <bitfield caption="Channel Alignment" mask="0x00000100" name="CALG"/>
          <bitfield caption="Channel Polarity" mask="0x00000200" name="CPOL"/>
          <bitfield caption="Channel Update Period" mask="0x00000400" name="CPD"/>
        </register>
        <register caption="PWM Channel Duty Cycle Register (ch_num = 3)" name="PWM_CDTY3" offset="0x264" rw="RW" size="4">
          <bitfield caption="Channel Duty Cycle" mask="0xFFFFFFFF" name="CDTY"/>
        </register>
        <register caption="PWM Channel Period Register (ch_num = 3)" name="PWM_CPRD3" offset="0x268" rw="RW" size="4">
          <bitfield caption="Channel Period" mask="0xFFFFFFFF" name="CPRD"/>
        </register>
        <register caption="PWM Channel Counter Register (ch_num = 3)" name="PWM_CCNT3" offset="0x26C" rw="R" size="4">
          <bitfield caption="Channel Counter Register" mask="0xFFFFFFFF" name="CNT"/>
        </register>
        <register caption="PWM Channel Update Register (ch_num = 3)" name="PWM_CUPD3" offset="0x270" rw="W" size="4">
          <bitfield mask="0xFFFFFFFF" name="CUPD"/>
        </register>
      </register-group>
      <value-group caption="" name="PWM_MR__DIVA">
        <value caption="CLKA, CLKB clock is turned off" name="CLK_OFF" value="0"/>
        <value caption="CLKA, CLKB clock is clock selected by PREA, PREB" name="CLK_DIV1" value="1"/>
      </value-group>
      <value-group caption="" name="PWM_MR__PREA">
        <value caption="Master Clock" name="MCK" value="0x0"/>
        <value caption="Master Clock divided by 2" name="MCKDIV2" value="0x1"/>
        <value caption="Master Clock divided by 4" name="MCKDIV4" value="0x2"/>
        <value caption="Master Clock divided by 8" name="MCKDIV8" value="0x3"/>
        <value caption="Master Clock divided by 16" name="MCKDIV16" value="0x4"/>
        <value caption="Master Clock divided by 32" name="MCKDIV32" value="0x5"/>
        <value caption="Master Clock divided by 64" name="MCKDIV64" value="0x6"/>
        <value caption="Master Clock divided by 128" name="MCKDIV128" value="0x7"/>
        <value caption="Master Clock divided by 256" name="MCKDIV256" value="0x8"/>
        <value caption="Master Clock divided by 512" name="MCKDIV512" value="0x9"/>
        <value caption="Master Clock divided by 1024" name="MCKDIV1024" value="0xA"/>
      </value-group>
      <value-group caption="" name="PWM_MR__DIVB">
        <value caption="CLKA, CLKB clock is turned off" name="CLK_OFF" value="0"/>
        <value caption="CLKA, CLKB clock is clock selected by PREA, PREB" name="CLK_DIV1" value="1"/>
      </value-group>
